Clash Bot Workflow - Apply
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Workflow Apply 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Run</summary>

#### Workflow Apply
```

terraform
module.create_team_step_function.data.aws_region.current[0]: Reading...
data.aws_acm_certificate.issued: Reading...
module.create_team_step_function.data.aws_caller_identity.current: Reading...
aws_iam_role.lambda_publisher_exec: Refreshing state... [id=clash_bot_event_publisher_exec_role-development]
aws_iam_role.lambda_handler_exec: Refreshing state... [id=clash_bot_event_handler_exec_role-development]
aws_cloudwatch_log_group.api_gateway_default_log_group: Refreshing state... [id=api_gateway_default_log_group-development]
module.dynamodb_table.aws_dynamodb_table.this[0]: Refreshing state... [id=clash-bot-workflow-development]
module.clash_bot_event_sqs.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/816923827429/clash-bot-event-sqs-development.fifo]
module.create_team_step_function.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.api_gateway.aws_apigatewayv2_api.this[0]: Refreshing state... [id=r0loqlg3t3]
module.create_team_step_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.create_team_step_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=4239894905]
module.create_team_step_function.aws_iam_role.this[0]: Refreshing state... [id=retrieve-teams-development]
module.create_team_step_function.data.aws_caller_identity.current: Read complete after 0s [id=816923827429]
module.create_team_step_function.data.aws_iam_policy_document.service["dynamodb"]: Reading...
data.aws_iam_policy_document.create_team_policy_document: Reading...
module.create_team_step_function.data.aws_iam_policy_document.service["dynamodb"]: Read complete after 0s [id=3233016293]
data.aws_iam_policy_document.create_team_policy_document: Read complete after 0s [id=1560313852]
module.create_team_step_function.aws_iam_policy.service["dynamodb"]: Refreshing state... [id=arn:aws:iam::816923827429:policy/retrieve-teams-development-dynamodb]
module.create_team_step_function.aws_sfn_state_machine.this[0]: Refreshing state... [id=arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development]
data.aws_iam_policy_document.event_publisher_policy_document: Reading...
data.aws_iam_policy_document.event_publisher_policy_document: Read complete after 0s [id=2002712062]
aws_iam_policy.event_publisher_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/ClashBotEventPublisherPolicy-development]
module.create_team_step_function.aws_iam_policy_attachment.service["dynamodb"]: Refreshing state... [id=retrieve-teams-development-dynamodb]
aws_lambda_function.event_publisher_lambda: Refreshing state... [id=clash-bot-event-publisher-development]
aws_iam_role_policy_attachment.lambda_publisher_exec_policy: Refreshing state... [id=clash_bot_event_publisher_exec_role-development-20231114032927127100000002]
data.aws_acm_certificate.issued: Read complete after 0s [id=arn:aws:acm:us-east-1:816923827429:certificate/1d277044-1781-46f9-b693-50c8ff95546a]
module.api_gateway.aws_apigatewayv2_domain_name.this[0]: Refreshing state... [id=clash-bot.ninja]
aws_iam_policy.event_handler_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/ClashBotWorkflowEventHandlerPolicy-development]
aws_lambda_function.event_handler_lambda: Refreshing state... [id=clash-bot-event-handler-development]
aws_iam_role_policy_attachment.lambda_handler_exec_policy: Refreshing state... [id=clash_bot_event_handler_exec_role-development-20231114032927103900000001]
aws_lambda_permission.apigw: Refreshing state... [id=AllowExecutionFromAPIGateway-development]
module.api_gateway.aws_apigatewayv2_integration.this["POST /api/v2/teams"]: Refreshing state... [id=zlvcq9c]
module.api_gateway.aws_apigatewayv2_stage.default[0]: Refreshing state... [id=$default]
aws_lambda_event_source_mapping.sqs_trigger: Refreshing state... [id=5d76167c-6bd9-488d-aee8-c6d122a624c1]
module.api_gateway.aws_apigatewayv2_route.this["POST /api/v2/teams"]: Refreshing state... [id=i2to2qo]
module.api_gateway.aws_apigatewayv2_api_mapping.this[0]: Refreshing state... [id=gt4pmg]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.event_handler_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "event_handler_policy_document" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:us-east-1:816923827429:clash-bot-event-sqs-development.fifo",
            ]
        }
      + statement {
          + actions   = [
              + "states:StartExecution",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_iam_policy.create_team_policy will be created
  + resource "aws_iam_policy" "create_team_policy" {
      + arn         = (known after apply)
      + description = "Policy for the create team lambda function."
      + id          = (known after apply)
      + name        = "ClashBotWorkflowCreateTeamPolicy-development"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "dynamodb:UpdateItem",
                          + "dynamodb:Query",
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:DeleteItem",
                          + "dynamodb:BatchWriteItem",
                          + "dynamodb:BatchGetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:us-east-1:816923827429:table/clash-bot-workflow-development"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
    }

  # aws_iam_policy.event_handler_policy will be updated in-place
  ~ resource "aws_iam_policy" "event_handler_policy" {
        id          = "arn:aws:iam::816923827429:policy/ClashBotWorkflowEventHandlerPolicy-development"
        name        = "ClashBotWorkflowEventHandlerPolicy-development"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:us-east-1:816923827429:clash-bot-event-sqs-development.fifo"
                    },
                  - {
                      - Action   = "states:StartExecution"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_iam_role.create_team_lambda_exec will be created
  + resource "aws_iam_role" "create_team_lambda_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "clash_bot_create_team_exec_role-development"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.create_team_lambda_exec_policy will be created
  + resource "aws_iam_role_policy_attachment" "create_team_lambda_exec_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "clash_bot_create_team_exec_role-development"
    }

  # aws_lambda_function.create_team_lambda will be created
  + resource "aws_lambda_function" "create_team_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "clash-bot-create-team-development"
      + handler                        = "prod/handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs16.x"
      + s3_bucket                      = "clash-bot-lambda-bucket"
      + s3_key                         = "artifacts/development/131/create-team.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TABLE_NAME" = "clash-bot-workflow-development"
            }
        }
    }

  # aws_lambda_function.event_handler_lambda will be updated in-place
  ~ resource "aws_lambda_function" "event_handler_lambda" {
        id                             = "clash-bot-event-handler-development"
      ~ last_modified                  = "2023-11-14T04:41:58.000+0000" -> (known after apply)
      ~ s3_key                         = "artifacts/development/126/event-handler.zip" -> "artifacts/development/131/event-handler.zip"
        tags                           = {}
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CREATE_TEAM_SF_ARN"            = "arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development"
              - "CREATE_TENTATIVE_QUEUE_SF_ARN" = "arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development"
              - "DELETE_TEAM_SF_ARN"            = "arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development"
              - "DELETE_TENTATIVE_QUEUE_SF_ARN" = "arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development"
              - "UPDATE_TEAM_SF_ARN"            = "arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development"
              - "UPDATE_TENTATIVE_QUEUE_SF_ARN" = "arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development"
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.event_publisher_lambda will be updated in-place
  ~ resource "aws_lambda_function" "event_publisher_lambda" {
        id                             = "clash-bot-event-publisher-development"
      ~ last_modified                  = "2023-11-14T04:41:58.000+0000" -> (known after apply)
      ~ s3_key                         = "artifacts/development/126/event-publisher.zip" -> "artifacts/development/131/event-publisher.zip"
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.create_team_step_function.aws_iam_policy.service["dynamodb"] must be replaced
-/+ resource "aws_iam_policy" "service" {
      ~ arn         = "arn:aws:iam::816923827429:policy/retrieve-teams-development-dynamodb" -> (known after apply)
      ~ id          = "arn:aws:iam::816923827429:policy/retrieve-teams-development-dynamodb" -> (known after apply)
      ~ name        = "retrieve-teams-development-dynamodb" -> "create-team-development-dynamodb" # forces replacement
      + name_prefix = (known after apply)
      ~ policy_id   = "ANPA34NDULTS67KFZ6COO" -> (known after apply)
      - tags        = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.create_team_step_function.aws_iam_policy_attachment.service["dynamodb"] must be replaced
-/+ resource "aws_iam_policy_attachment" "service" {
      - groups     = [] -> null
      ~ id         = "retrieve-teams-development-dynamodb" -> (known after apply)
      ~ name       = "retrieve-teams-development-dynamodb" -> "create-team-development-dynamodb" # forces replacement
      ~ policy_arn = "arn:aws:iam::816923827429:policy/retrieve-teams-development-dynamodb" # forces replacement -> (known after apply) # forces replacement
      ~ roles      = [
          - "retrieve-teams-development",
          + "create-team-development",
        ]
      - users      = [] -> null
    }

  # module.create_team_step_function.aws_iam_role.this[0] must be replaced
-/+ resource "aws_iam_role" "this" {
      ~ arn                   = "arn:aws:iam::816923827429:role/retrieve-teams-development" -> (known after apply)
      ~ create_date           = "2023-11-14T03:29:26Z" -> (known after apply)
      ~ id                    = "retrieve-teams-development" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::816923827429:policy/retrieve-teams-development-dynamodb",
        ] -> (known after apply)
      ~ name                  = "retrieve-teams-development" -> "create-team-development" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ unique_id             = "AROA34NDULTSZ33FEM5RV" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.create_team_step_function.aws_sfn_state_machine.this[0] must be replaced
-/+ resource "aws_sfn_state_machine" "this" {
      ~ arn                       = "arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development" -> (known after apply)
      ~ creation_date             = "2023-11-14T02:19:07Z" -> (known after apply)
      ~ definition                = <<-EOT
            {
                "Comment": "A Hello World example of the Amazon States Language using Pass states",
                "StartAt": "Hello",
                "States": {
                  "Hello": {
                    "Type": "Pass",
                    "Result": "Hello",
                    "Next": "World"
                  },
                  "World": {
                    "Type": "Pass",
                    "Result": "World",
                    "End": true
                  }
                }
              }
        EOT -> (known after apply)
      + description               = (known after apply)
      ~ id                        = "arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development" -> (known after apply)
      ~ name                      = "retrieve-teams-development" -> "create-team-development" # forces replacement
      + name_prefix               = (known after apply)
      + revision_id               = (known after apply)
      ~ role_arn                  = "arn:aws:iam::816923827429:role/retrieve-teams-development" -> (known after apply)
      + state_machine_version_arn = (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
      ~ tags                      = {
          ~ "Name" = "retrieve-teams-development" -> "create-team-development"
        }
      ~ tags_all                  = {
          ~ "Name"        = "retrieve-teams-development" -> "create-team-development"
            # (2 unchanged elements hidden)
        }
      + version_description       = (known after apply)
        # (2 unchanged attributes hidden)

      - logging_configuration {
          - include_execution_data = false -> null
          - level                  = "OFF" -> null
        }

      - tracing_configuration {
          - enabled = false -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 8 to add, 3 to change, 4 to destroy.

Changes to Outputs:
  ~ step-function-arn              = "arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development" -> (known after apply)
module.create_team_step_function.aws_iam_policy_attachment.service["dynamodb"]: Destroying... [id=retrieve-teams-development-dynamodb]
module.create_team_step_function.aws_sfn_state_machine.this[0]: Destroying... [id=arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development]
aws_iam_policy.create_team_policy: Creating...
aws_lambda_function.event_publisher_lambda: Modifying... [id=clash-bot-event-publisher-development]
module.create_team_step_function.aws_iam_policy_attachment.service["dynamodb"]: Destruction complete after 0s
module.create_team_step_function.aws_iam_policy.service["dynamodb"]: Destroying... [id=arn:aws:iam::816923827429:policy/retrieve-teams-development-dynamodb]
module.create_team_step_function.aws_iam_policy.service["dynamodb"]: Destruction complete after 0s
module.create_team_step_function.aws_iam_policy.service["dynamodb"]: Creating...
aws_iam_policy.create_team_policy: Creation complete after 0s [id=arn:aws:iam::816923827429:policy/ClashBotWorkflowCreateTeamPolicy-development]
module.create_team_step_function.aws_iam_policy.service["dynamodb"]: Creation complete after 1s [id=arn:aws:iam::816923827429:policy/create-team-development-dynamodb]
aws_lambda_function.event_publisher_lambda: Modifications complete after 8s [id=clash-bot-event-publisher-development]
module.create_team_step_function.aws_sfn_state_machine.this[0]: Still destroying... [id=arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development, 10s elapsed]
module.create_team_step_function.aws_sfn_state_machine.this[0]: Still destroying... [id=arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development, 20s elapsed]
module.create_team_step_function.aws_sfn_state_machine.this[0]: Still destroying... [id=arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development, 30s elapsed]
module.create_team_step_function.aws_sfn_state_machine.this[0]: Still destroying... [id=arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development, 40s elapsed]
module.create_team_step_function.aws_sfn_state_machine.this[0]: Still destroying... [id=arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development, 50s elapsed]
module.create_team_step_function.aws_sfn_state_machine.this[0]: Still destroying... [id=arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development, 1m0s elapsed]
module.create_team_step_function.aws_sfn_state_machine.this[0]: Still destroying... [id=arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development, 1m10s elapsed]
module.create_team_step_function.aws_sfn_state_machine.this[0]: Destruction complete after 1m13s
module.create_team_step_function.aws_iam_role.this[0]: Destroying... [id=retrieve-teams-development]
aws_iam_role.create_team_lambda_exec: Creating...
module.create_team_step_function.aws_iam_role.this[0]: Destruction complete after 0s
module.create_team_step_function.aws_iam_role.this[0]: Creating...
aws_iam_role.create_team_lambda_exec: Creation complete after 0s [id=clash_bot_create_team_exec_role-development]
aws_iam_role_policy_attachment.create_team_lambda_exec_policy: Creating...
aws_lambda_function.create_team_lambda: Creating...
aws_iam_role_policy_attachment.create_team_lambda_exec_policy: Creation complete after 1s [id=clash_bot_create_team_exec_role-development-20231117070359518300000001]
module.create_team_step_function.aws_iam_role.this[0]: Creation complete after 1s [id=create-team-development]
module.create_team_step_function.aws_iam_policy_attachment.service["dynamodb"]: Creating...
module.create_team_step_function.aws_iam_policy_attachment.service["dynamodb"]: Creation complete after 0s [id=create-team-development-dynamodb]
aws_lambda_function.create_team_lambda: Still creating... [10s elapsed]
aws_lambda_function.create_team_lambda: Creation complete after 14s [id=clash-bot-create-team-development]
module.create_team_step_function.aws_sfn_state_machine.this[0]: Creating...
module.create_team_step_function.aws_sfn_state_machine.this[0]: Creation complete after 0s [id=arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development]
data.aws_iam_policy_document.event_handler_policy_document: Reading...
data.aws_iam_policy_document.event_handler_policy_document: Read complete after 0s [id=2287429511]
aws_iam_policy.event_handler_policy: Modifying... [id=arn:aws:iam::816923827429:policy/ClashBotWorkflowEventHandlerPolicy-development]
aws_lambda_function.event_handler_lambda: Modifying... [id=clash-bot-event-handler-development]
aws_iam_policy.event_handler_policy: Modifications complete after 0s [id=arn:aws:iam::816923827429:policy/ClashBotWorkflowEventHandlerPolicy-development]
aws_lambda_function.event_handler_lambda: Still modifying... [id=clash-bot-event-handler-development, 10s elapsed]
aws_lambda_function.event_handler_lambda: Modifications complete after 14s [id=clash-bot-event-handler-development]

Apply complete! Resources: 8 added, 3 changed, 4 destroyed.

Outputs:

api-gateway-endpoint = "https://r0loqlg3t3.execute-api.us-east-1.amazonaws.com"
event-handler-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:clash-bot-event-handler-development"
event-handler-lambda-version = "$LATEST"
event-publisher-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:clash-bot-event-publisher-development"
event-publisher-lambda-version = "$LATEST"
event-sqs = "arn:aws:sqs:us-east-1:816923827429:clash-bot-event-sqs-development.fifo"
step-function-arn = "arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development"

```

</details>

*Pushed by: @Poss111, Action: `pull_request`*